{
  "news":[
    {
      "date": "2023-02-05",
      "title": "Security and Platform Upgrades, Multiverse progress",
      "body": "Progress has resumed with a round of security and platform upgrades, and some major re-organizations to work with latest Multiverse backend server updates. Multiverse server was migrated to Typescript and initial end-to-end core platform implemented, though much work remains to adding game and simulation logic.\n\nAfter initial simulation logic is added, we're hoping to expand multiplayer and network testing in 2023; join Discord for more updates",
      "items": [
        "website platform nuxt upgrades",
        "began conversion to typescript",
        "added real-time network browser-server socket communication",
        "progress Multiverse server platform, threading and persistence"
      ]
    },
    {
      "date": "2021-01-03",
      "title": "Happy New Year!",
      "body": "Big round of updates adding several new menus, with basic API integrations and Multiverse logic. Rendering improvements to support building signs and interface changes to support inspect menus, including initial versions for townhalls and trade centers.",
      "items": [
        "game menus including chat, rankings, search, and politics",
        "building signs and initial inspect menus",
        "position history and jump-to widget",
        "additional API integrations for game data"
      ]
    },
    {
      "date": "2020-09-21",
      "title": "Dependency Upgrades, Pre-Alpha Multiverse support",
      "body": "Core logic updates and initial support for Tycoon, Corporation, and Company creation, plus a round of technology dependency upgrades. More client changes to align with Multiverse server API, with first successful connections to running backend server. Multiverse backend server still not ready for public, but progress has been made towards pre-alpha testing.",
      "items": [
        "upgrade dependencies",
        "basic Tycoon, Corporation, and Company creation interfaces",
        "initial Multiverse server API integration"
      ]
    },
    {
      "date": "2020-04-04",
      "title": "Dependency Upgrades, Documentation, and Internal API Progress",
      "body": "Round of dependency upgrades, documentation, and core logic updates. Lots of internal website client changes to align with Multiverse server API and library types. Progress also made towards first version of the Multiverse backend server.",
      "items": [
        "upgrade dependencies",
        "library types and documentation for Multiverse API",
        "sandbox and internal logic alignment with Multiverse API"
      ]
    },
    {
      "date": "2019-01-13",
      "title": "New Year, New Milestone",
      "body": "Happy New Year!\n\nWe're excited to announce STARPEACE client v0.3.0 with initial building construction gameplay and menu integration! With sufficient cash, research, and other requirements, buildings can be selected for construction and placed on available land or water.\n\nThis also concludes the v0.2.x project milestone; see archives for full history. Visit the release notes to learn more about upcoming features and the focus of the next client milestone.",
      "items": [
        "initial building industry and warehouse resource metadata",
        "building construction menu and basic game-map integration"
      ]
    },
    {
      "date": "2018-11-05",
      "title": "Client News, improved Systems and Planet menus, and initial internal AJAX structure!",
      "body": "Hi everyone!\n\nWe're pleased to introduce the STARPEACE client news widget for game updates and other announcements! Watch this space for feature change details, follow on Twitter, or checkout the release notes for version feature information.\n\nAlso further improved corporation, system, and planets workflows and selection interfaces, integrating client login state management and placeholder server AJAX API calls with dummy data responses.",
      "items": [
        "client updates UI and recent news integration",
        "improved system and planet selection interface; integration with corporation and existing companies information",
        "improved tycoon login workflow, simulated authorization sequence, placeholder game and player metadata",
        "initial AJAX structure for server API calls, placeholder dummy data responses"
      ]
    }
  ]
}
